Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཤཱ་རིའི་བུ་གལ་ཏེ་དེ་བཞིན་གཤེགས་པས་ས་འདི་ལ་ཡུངས་ཀར་གྱི་འབྲུ་གཅིག་བཞག་ན། དེ་བཞིན་གཤེགས་པས་ཡུངས་ཀར་གྱི་འབྲུ་བཞག་པ་དེ་ཡང་དེ་ལྟ་བུའི་ཉན་ཐོས་ཀྱི་ཚོགས་ཀྱི་མཐུ་དང་། སྟོབས་དང་། བརྩོན་འགྲུས་དང་། དྲག་ཤུལ་ཐམས་ཅད་དང་། རྫུ་འཕྲུལ་དང་། ཆོ་འཕྲུལ་གྱི་སྟོབས་ཐམས་ཅད་བསྟན་ཀྱང་དེ་བཞིན་གཤེགས་པས་བཞག་པའི་ཡུངས་ཀར་གྱི་འབྲུ་སྐྲའི་རྩེ་མོ་གཅིག་ཙམ་ཡང་བསྐྱོད་པར་མི་ནུས་སོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་རྫུ་འཕྲུལ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པའོ། །
en: “Śāriputra, say that the Tathāgata were to put a single mustard seed on the ground. When that mustard seed had been placed there by the Tathāgata, all the strength, power, vigor, and force, all the magical and miraculous abilities, that such a host of śrāvakas could display would not be sufficient to move the mustard seed that had been placed there by the Tathāgata even a hair’s breadth. Why is this? Śāriputra, it is because the tathāgata, arhat, fully accomplished Buddha has attained the highest possible degree of perfection in the perfection of magical and miraculous abilities.

source: ཤཱ་རིའི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ལྟ་ཞོག་ལ། ཤཱ་རིའི་བུ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ན་སེམས་ཅན་ཇི་སྙེད་ཡོད་པ་དང་། དེ་བཞིན་དུ་ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། འོག་དང་། སྟེང་དང་། ཕྱོགས་མཚམས་དང་། ཕྱོགས་བཅུ་ཀུན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ནི་སེམས་ཅན་ཇི་ཙམ་སྒོ་ང་ལས་སྐྱེས་པའམ། མངལ་ནས་སྐྱེས་པ་ནས་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་གྱི་བར་གྱི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཡོངས་སུ་བརྟག་པ་བཟུང་སྟེ། ཉན་ཐོས་རྫུ་འཕྲུལ་ཆེན་པོ་འདི་ལྟ་སྟེ་དཔེར་ན། མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལྟ་བུར་གྱུར་ལ། ཤཱ་རིའི་བུ་དེ་ལྟ་བུའི་ཉན་ཐོས་ཀྱི་ཚོགས་ཐམས་ཅད་ཀྱིས་སྟོབས་དང་། མཐུ་དང་། དྲག་ཤུལ་ཐམས་ཅད་དང་། རྫུ་འཕྲུལ་དང་། ཆོ་འཕྲུལ་གྱི་སྟོབས་ཐམས་ཅད་བསྟན་ཀྱང་ཡུངས་འབྲུ་ཡང་གདེག་པར་མི་ནུས་ཏེ ཐ་ན་སྐྲའི་རྩེ་མོའི་ཆ་ཙམ་ཡང་བསྐྱོད་པར་མི་ནུས་སོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་རྫུ་འཕྲུལ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ་སྟེ། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་དེ་ལྟར་རྫུ་འཕྲུལ་ཆེ། དེ་ལྟར་མཐུ་ཆེ། དེ་ལྟར་དབང་ཆེ་བར་གྲགས་པའོ། །
en: “Consider not only the sentient beings of the threefold thousand great thousand world, Śāriputra, but as many sentient beings as there are in the eastern direction, in worlds, Śāriputra, as numerous as the grains of sand in the river Ganges, and likewise in the southern, the western, and the northern directions, below, above, and in the intermediate directions, throughout all the ten directions, in worlds as numerous as the grains of sand in the river Ganges—beings born from an egg, born from a womb, and so forth, up to and including those with neither perception nor nonperception—and imagine that they all became śrāvakas with the same great magical abilities as the elder Mahāmaudgalyāyana. Śāriputra, all the strength, power, and force, all the magical and miraculous abilities that such a host of śrāvakas could display would not be sufficient to move that mustard seed. It would not be sufficient to move it even a hair’s breadth. Why is this? Śāriputra, it is because the Tathāgata has attained the highest possible degree of perfection in the perfection of magical abilities. Śāriputra, this is how great the magical abilities of the Tathāgata are. This is how great his authority is. He is a great lord.”

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་ཁྱོད་ཀྱིས་ནམ་འཇིག་པའི་བསྐལ་པའི་དུས་ཀྱི་ཚེར་གྱུར་པ་དེ་ན་ཀུན་ཏུ་འཇོམ་པ་ཞེས་བྱའི་རླུང་ལྡང་སྟེ། རླུང་དེ་ལངས་པས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡི་རིའི་རྒྱལ་པོ་རི་རབ་དང་། ཁོར་ཡུག་གི་རི་དང་། ཁོར་ཡུག་གི་རི་ཆེན་པོ་དང་། གླིང་ཆེན་པོ་བཞི་དང་། གླིང་བརྒྱད་ཁྲི་དང་། རི་ཆེན་པོ་དང་། རྒྱ་མཚོ་ཆེན་པོ་ཡང་དཔག་ཚད་སྲིད་དུ་མངོན་པར་འཕེན་ཅིང་རབ་ཏུ་འཐོར་བར་འགྱུར་བ་ཁྱོད་ཀྱིས་ཐོས་སམ།
en: The Lord then addressed the elder Śāriputra, “Have you heard, Śāriputra, that a wind blows at the time of the passing of an eon? These winds are called the destroyers, and when they blow, the threefold thousand great thousand worlds, Sumeru, the king of mountains, the Cakravāḍa Mountains, the Mahācakravāḍa Mountains, the four great continents, the eighty thousand islands, the great mountains, and the great oceans will be shattered and scattered over one yojana.”

source: གསོལ་པ། བདག་གིས་བཅོམ་ལྡན་འདས་ལས་མངོན་སུམ་དུ་ཐོས་ཏེ་ མངོན་སུམ་དུ་བཟུང་ངོ་། །
en: He replied, “Yes, I have heard the Tathāgata speak of this, and I have understood it to be so.”

source: བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་ནམ་འཇིག་པའི་རླུང་འབྱུང་བ་དེ་ནི་ཀུན་ཏུ་འཇོམ་པ་ཆེན་པོ་ཞེས་བྱའི་རླུང་ལྡང་སྟེ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རི་རབ་དང་བཅས། ཁོར་ཡུག་དང་བཅས། རི་དང་བཅས། རྒྱ་མཚོ་དང་བཅས། དཔག་ཚད་བརྒྱར་མངོན་པར་འཕེན་ཅིང་རབ་ཏུ་འཐོར། དཔག་ཚད་ཉིས་བརྒྱ་དང་། དཔག་ཚད་སུམ་བརྒྱ་དང་། དཔག་ཚད་བཞི་བརྒྱ་དང་། དཔག་ཚད་ལྔ་བརྒྱ་དང་། དཔག་ཚད་སྟོང་དང་། དཔག་ཚད་ཉིས་སྟོང་དང་། སུམ་སྟོང་དང་། བཞི་སྟོང་དང་། ལྔ་སྟོང་དུ་མངོན་པར་འཕེན་ཅིང་རབ་ཏུ་འཐོར། དཔག་ཚད་བརྒྱ་ཕྲག་མང་པོ་དང་། དཔག་ཚད་སྟོང་ཕྲག་མང་པོ་དང་དཔག་ཚད་བརྒྱ་སྟོང་ཕྲག་མང་པོར་མངོན་པར་འཕེན་ཅིང་རབ་ཏུ་འཐོར་ཏེ། དེ་དག་གི་རྡུལ་ཡང་མི་སྣང་ན་རི་དང་རྡོ་རྣམས་ལྟ་ཅི་སྨོས། འཐབ་བྲལ་གྱི་ལྷ་རྣམས་ཀྱི་གཞལ་མེད་ཁང་རྣམས་ཀྱང་དཀྲུགས་བཅོམ། རབ་ཏུ་གཏོར་ཏེ། དེ་དག་གི་རྡུལ་ཡང་མི་སྣང་ན་གཞལ་མེད་ཁང་རྣམས་ལྟ་ཅི་སྨོས། དགའ་ལྡན་པ་རྣམས་དང་། འཕྲུལ་དགའ་བ་རྣམས་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་བདུད་ཀྱི་རིས་རྣམས་དང་། ཚངས་པ་རྣམས་དང་འོད་གསལ་བ་རྣམས་དང་། དགེ་རྒྱས་ཀྱི་ལྷ་རྣམས་ཀྱི་གཞལ་མེད་ཁང་གི་བར་དུ་དེ་བཞིན་དུ་རྒྱས་པར་བྱའོ། ། ཇི་ལྟར་འཐབ་བྲལ་གྱི་དཀྲུགས་བཅོམ་རབ་ཏུ་གཏོར་ཏེ། དཀྲུགས་བཅོམ་རབ་ཏུ་གཏོར་བ་དེ་དག་གི་རྡུལ་ཡང་མི་སྣང་ན་གཞལ་མེད་ཁང་དང་ར་བ་རྣམས་ལྟ་ཅི་སྨོས། ཤཱ་རིའི་བུ་གལ་ཏེ་དེ་ལྟ་བུའི་རླུང་ལངས་ཀྱང་དེས་དེ་བཞིན་གཤེགས་པའི་ཆོས་གོས་ཀྱི་མཐའ་མའི་རྩེ་མོ་ཙམ་ཡང་གཡོས་པར་མི་ནུས་ན། ཆོས་གོས་སམ། ཆོས་གོས་ཀྱི་གྲ་ལྟ་ཅི་སྨོས། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་བསམ་གྱིས་མི་ཁྱབ་པའི་རྫུ་འཕྲུལ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་སྤྱོད་ལམ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་ལམ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་ནོ། ། ཤཱ་རིའི་བུ་གལ་ཏེ་འདི་ལྟ་བུའི་རླུང་གི་དཀྱིལ་འཁོར་ཤར་ཕྱོགས་དང་། ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། འོག་དང་། སྟེང་དང་། ཕྱོགས་མཚམས་དང་། ཕྱོགས་བཅུ་ཀུན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་རླུང་མངོན་པར་ལྡང་ཡང་། ཤཱ་རིའི་བུ་འཇིག་རྟེན་གྱི་ཁམས་འཇིགས་པར་བྱེད་པའི་རླུང་གི་དཀྱིལ་འཁོར་དེ་དེ་བཞིན་གཤེགས་པའི་སོར་མོའི་རྩེ་མོས་ཟློག་ཀྱང་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་དང་། ཆོ་འཕྲུལ་གྱི་སྟོབས་བྲི་བ་ཡང་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་བསམ་གྱིས་མི་ཁྱབ་སྟེ། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་དད། ཡིད་ཆེས། སོམ་ཉི་མེད། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ། རངས་པ་རྙེད་ནས་ངོ་མཚར་དང་། རྨད་དུ་འདུ་ཤེས་སྐྱེད་དོ། །
en: He said, “Śāriputra, at the time of this destructive wind, winds called the great destroyers will blow. Sumeru and its surrounding mountain range and the mountains and oceans of the threefold thousand great thousand worlds will then be completely shattered and scattered widely over a hundred yojanas. They will be completely shattered and scattered widely over two hundred yojanas, three hundred yojanas, and four and five hundred yojanas, over a thousand yojanas, and over two, three, four and five thousand yojanas; they will be shattered and scattered over many hundred yojanas, many thousand yojanas, many hundreds of thousands of yojanas. Not even the smallest trace of them will be left behind, let alone whole mountains or rocks. The palaces of the yāma gods will shake, fracture, and crumble, and not even the smallest trace of them will be left behind, let alone whole palaces. It will be the same with the palaces of the gods of Tuṣita Heaven, of the Heaven of the Joy of Creation, of the Heaven of the Power over Others’ Creations, of the mārakāyika gods, of the gods of the brahmā heavens, of the Heaven of Brilliance, of the Heaven of Vast Virtue, and so forth. Like those of the yāmas they will shake, fracture, and crumble, and when they shake, fracture, and crumble not even the smallest trace will be left behind, let alone whole palaces or courtyards. Still, Śāriputra, even if such a wind were to blow, it would not be able to move even the tip of the Tathāgata’s robe, let alone a fold of the robe or the whole robe. Why is this? It is because the magical abilities of the tathāgata, arhat, fully accomplished Buddha are inconceivable, his conduct is inconceivable, his ways are inconceivable, and his great compassion is inconceivable. Śāriputra, if such winds were blowing fiercely in worlds as numerous as the grains of sand in the river Ganges, in the east, in the south, in the west, in the north, above, below, and in the intermediate directions—in all ten directions—still, Śāriputra, the Tathāgata could stop these world-destroying wind systems with the tip of his finger, and there would be no noticeable lessening of the Tathāgata’s magical or miraculous abilities. Why is this? Śāriputra, it is because the Tathāgata’s magical tathāgata-abilities are inconceivable, and that is why the bodhisatva has faith in them and trusts them. This is why he has no uncertainty or doubt about them. This is why the Tathāgata brings him pleasure, joy, and satisfaction, and why he considers him to be truly wondrous and extraordinary.”

source: ཁམས་གསུམ་སེམས་ཅན་ཇི་སྙེད་པ། །གནས་བརྟན་མཽདགལ་བུ་བཞིན་དུ། །རྫུ་འཕྲུལ་ཕ་རོལ་ཕྱིན་པ་ཡི། །ཉན་ཐོས་མཁས་པར་ཀུན་གྱུར་པས། །རྫུ་འཕྲུལ་ཐམས་ཅད་རབ་བརྟན་ཀྱང་། །དེ་བཞིན་གཤེགས་པས་ས་འདི་ལ། །ཡུངས་ཀར་གྱི་ནི་འབྲུ་གཞག་པ། །གཡོ་བར་བྱ་བར་མི་ནུས་སོ།
en: “If all the beings in the three realms Were to become wise śrāvakas And as adept in magical abilities As the elder Maudgalyāyana, “And the Tathāgata placed A mustard seed on the ground, Then all the magic they could muster Would not suffice to move it.

source: གང་རྣམས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ཁམས། །གང་གཱ་ཡི་ནི་བྱེ་མ་སྙེད། །རྣམ་འཐོར་རླུང་དང་ཀུན་འཇོམས་པ། །རླུང་རྣམས་ཕྱོགས་བཅུར་ལངས་པར་གྱུར། །
en: “In the worlds of the ten directions, As many as the sands of the Ganges, The winds called the howlers and the destroyers Will blow from the ten directions.

source: དེ་ལྟ་བུ་ཡི་རླུང་ཆེན་དེས། །
en: “However great these winds are, though,

source: ཐམས་ཅད་གཟིགས་པའི་ཆོས་གོས། །མཐའ་མ་སྐྲ་ཡི་རྩེ་ཙམ་ཡང་། །གཡོ་བར་བྱ་བར་མི་ནུས་སོ། །
en: They will not suffice to move The robe of the all seer Even a hair’s breadth.

source: ཐུབ་པ་ཆེན་པོའི་སྤུ་གཅིག་གིས། །རླུང་དེ་རབ་ཏུ་ཟློག་པར་མཛད། །
en: “A single hair of the great saint Could turn these winds back.

source: སངས་རྒྱས་རྫུ་འཕྲུལ་འདི་འདྲ་བ། །མཐའ་ཡས་པ་ནི་ནམ་མཁའ་བཞིན། །
en: Such are the magical abilities of the Buddha— They are as vast as the heavens.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་པར་དད། ཡིད་ཆེས་པ་ནས་ངོ་མཚར་དང་རྨད་ཀྱི་བར་དུ་འདུ་ཤེས་སྐྱེད་དོ། །
en: “This, Śāriputra, is why the bodhisatva has great faith in the tathāgatas’ magical tathāgata-abilities. This is why he trusts them, and so forth. This is why he considers them to be truly wondrous and extraordinary.

source: ཡང་ཤཱ་རིའི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། སོམ་ཉི་མེད། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ། རངས་པ་རྙེད་ནས། ངོ་མཚར་དང་རྨད་དུ་འདུ་ཤེས་སྐྱེད་ཅེ་ན།
en: “Furthermore, Śāriputra, what is it about the Tathāgata’s inconceivable tathāgata-power that leads the bodhisatva to have great faith in him? What is it that leads the bodhisatva to trust and have confidence in him and not to doubt him? What is it that brings him pleasure, joy, and satisfaction and leads him to consider the Tathāgata to be truly wondrous and extraordinary?

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་ནི་བཅུ་པོ་འདི་དག་སྟེ། སྟོབས་དེ་དག་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་ཁྱུ་མཆོག་གི་གནས་སུ་དམ་འཆའ་ཞིང་དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ། ལྷ་འམ། བདུད་དམ། ཚངས་པའམ། སུས་ཀྱང་འཇིག་རྟེན་འདིར་ཆོས་དང་འཐུན་པར་མ་བསྐོར་བའི་ཚངས་པའི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་ཏོ། ། བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། གནས་དང་གནས་མ་ཡིན་པ་མཁྱེན་པའི་སྟོབས་དང་། ལས་དང་རྣམ་པར་སྨིན་པ་མཁྱེན་པའི་སྟོབས་དང་། མོས་པ་དུ་མ་དང་། མོས་པ་སྣ་ཚོགས་མཁྱེན་པའི་སྟོབས་དང་། ཁམས་དུ་མ་དང་། ཁམས་སྣ་ཚོགས་མཁྱེན་པའི་སྟོབས་དང་། དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་རིམ་པ་མཁྱེན་པའི་སྟོབས་དང་། ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་མཁྱེན་པའི་སྟོབས་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དང་། ལྡང་བ་མཁྱེན་པའི་སྟོབས་དང་། སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་མངོན་སུམ་དུ་བྱེད་པ་མཁྱེན་པའི་སྟོབས་དང་། འཆི་འཕོ་དང་། སྐྱེ་བ་མངོན་སུམ་དུ་བྱེད་པ་མཁྱེན་པའི་སྟོབས་དང་། ཟག་པ་ཟད་པ་མངོན་སུམ་དུ་བྱེད་པ་མཁྱེན་པའི་སྟོབས་སོ། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་པོ་དེ་དག་སྟེ། སྟོབས་དེ་དག་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་འཁོར་གྱི་ནང་དུ་ཡང་དག་པར་སེང་གེའི་སྒྲ་སྒྲོག་ཅིང་ཁྱུ་མཆོག་གི་གནས་སུ་ཞལ་གྱི་འཆེ་བ་ནས། སུས་ཀྱང་འཇིག་རྟེན་དུ་ཆོས་དང་འཐུན་པར་མ་བསྐོར་བ་ཚངས་པའི་འཁོར་ལོ་རབ་ཏུ་སྐོར་བའི་བར་དུའོ། །
en: Śāriputra, the Tathāgata has ten tathāgata-powers, and with these powers the Tathāgata asserts the state of the supreme bull. He turns the holy wheel that no ascetic, brahmin, god, māra, or brahmā of this world has legitimately turned. What are these ten powers? They are the power to know what is possible and what is impossible, the power to know the ripening of the fruits of actions, the power to know the various different elements, the power to know the various different kinds of inclination, the power to know the extent of faculties and vigor, the power to know the suitable path in every situation, the power to know how the defilements arise and are purified in the context of liberative meditative states and the attainments of concentration, the power of having clear experiential recollection of past states of existence, the power of having direct experiential knowledge of the process of death and rebirth, and the power of knowing through direct experience that the defilements have been eliminated. Śāriputra, these are the ten tathāgata powers of the Tathāgata. With these powers the Tathāgata roars a true lion’s roar in the assembly, and asserting the state of the supreme bull he turns the holy wheel not legitimately turned by anyone in the world.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པའི་གནས་དང་། གནས་མ་ཡིན་པ་མཁྱེན་པའི་སྟོབས་གང་ཞེ་ན། འདི་ལ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་བླ་ན་ མེད་པའི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་གནས་ཀྱང་གནས་སུ། གནས་མ་ཡིན་པའང་གནས་མ་ཡིན་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། དེ་ལ་གནས་གང་། གནས་མ་ཡིན་པ་གང་ཞེ་ན། ཤཱ་རིའི་བུ་གང་ལུས་ཀྱིས་ཉེས་པར་སྤྱོད་པའི་རྣམ་པར་སྨིན་པ་འདོད་པ་དང་། སྡུག་པ་དང་། དགའ་བ་དང་། ཡིད་དུ་འོང་བ་མངོན་པར་འགྲུབ་པ་དེ་ནི་གནས་མ་ཡིན་ཏེ། སྐབས་མེད་དོ། ། གང་ལུས་ཀྱིས་ཉེས་པར་སྤྱད་པ་དང་། ངག་གིས་ཉེས་པར་སྤྱད་པ་དང་། ཡིད་ཀྱིས་ཉེས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པ་མི་འདོད་པ་དང་། མི་སྡུག་པ་དང་། མི་དགའ་བ་དང་། ཡིད་དུ་མི་འོང་བ་མངོན་པར་འགྲུབ་པ་དེ་ནི་གནས་ཡིན་ཏེ་ སྐབས་ཡོད་དོ། ། གང་ལུས་ཀྱིས་ལེགས་པར་སྤྱད་པ་དང་། ངག་གིས་ལེགས་པར་སྤྱད་པ་དང་། ཡིད་ཀྱིས་ལེགས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པ་མི་འདོད་པ་དང་། མི་སྡུག་པ་དང་། མི་དགའ་བ་དང་། ཡིད་དུ་མི་འོང་བ་མངོན་པར་འགྲུབ་པ་དེ་ནི་གནས་མ་ཡིན་ཏེ། སྐབས་མེད་དོ། ། གང་ལུས་ཀྱིས་ལེགས་པར་སྤྱད་པ་དང་། ངག་གིས་ལེགས་པར་སྤྱད་པ་དང་། ཡིད་ཀྱིས་ལེགས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པ། འདོད་པ་དང་། སྡུག་པ་དང་། དགའ་བ་དང་། ཡིད་དུ་འོང་བ་མངོན་པར་འགྲུབ་པ་དེ་ནི་གནས་ཡིན་ཏེ སྐབས་ཡོད་དོ།
en: “What does the Tathāgata’s power to know what is possible and what is impossible entail? Śāriputra, it means that with his unsurpassed tathāgata power of knowledge, the Tathāgata truly understands what is possible, as well as what is impossible. Now, what is possible and what is impossible? Śāriputra, it is not possible that bodily misconduct will lead to what is desirable, pleasing, favored, and agreeable. This is what is impossible. Bodily, verbal, and mental misconduct will lead to what is undesirable, disagreeable, unwanted, and difficult. This is what is possible. It is not possible that good bodily, verbal, and mental conduct will lead to what is undesirable, disagreeable, unwanted, and difficult. This is what is impossible. This is not what happens. Good bodily, verbal, and mental conduct will lead to what is desirable, pleasing, favored, and agreeable. This is what is possible.

source: ཤཱ་རིའི་བུ་འདི་ནི་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་སེར་སྣས་ལོངས་སྤྱོད་ཆེན་པོ་མངོན་པར་འགྲུབ་པ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་སེར་སྣས་དབུལ་པོར་འགྱུར་བ་དེ་ནི་གནས་ཡིན་ཏེ། སྐབས་ཡོད་དོ། ། འདི་ནི་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་སྦྱིན་བས་དབུལ་པོར་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་སྦྱིན་པས་ལོངས་སྤྱོད་ཆེན་པོ་མངོན་པར་འགྲུབ་པ་དེ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། །
en: “Śāriputra, it is not possible that miserliness will lead to great riches. This is what is impossible. Miserliness will lead to poverty. It is not possible that generosity will lead to poverty. This is what is impossible. Generosity will lead to great riches.

source: ཤཱ་རིའི་བུ་འདི་ནི་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་འཆལ་བའི་ཚུལ་ཁྲིམས་ཀྱིས་ལྷ་དང་མིར་སྐྱེ་བ་རྙེད་པ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་འཆལ་པའི་ཚུལ་ཁྲིམས་ཀྱིས་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་སྐྱེ་བ་དེ་ནི་གནས་ཡིན་ཏེ། སྐབས་ཡོད་དོ། ། ཤཱ་རིའི་བུ་འདི་ནི་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་ཚུལ་ཁྲིམས་ཀྱིས་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་སྐྱེ་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་ཚུལ་ཁྲིམས་ཀྱིས་ལྷ་དང་མིར་སྐྱེ་བ་ཐོབ་པ་དེ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། །
en: “Śāriputra, it is not possible that immoral conduct will result in rebirth as a god or a human being. This is what is impossible. Immoral conduct will result in rebirth in hell, among animals, or in the spirit world governed by Yama. Śāriputra, it is not possible that morally good conduct will result in rebirth in hell, among animals, or in the spirit world governed by Yama. This is what is impossible. Morally good conduct will result in rebirth as a god or a human being.

source: ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་གནོད་སེམས་ཀྱིས་གཟུགས་མཛེས་པ་མངོན་པར་འགྲུབ་པ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་གནོད་སེམས་ཀྱིས་གཟུགས་མི་སྡུག་པ་མངོན་པར་འགྲུབ་པ་དེ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། ། ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་བཟོད་པས་གཟུགས་མི་སྡུག་པ་མངོན་པར་འགྲུབ་པ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་བཟོད་པས་གཟུགས་མཛེས་པ་མངོན་པར་འགྲུབ་པ་དེ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། །
en: “Śāriputra, it is not possible that malice will lead to beauty. This is what is impossible. Malice will lead to ugliness. Śāriputra, it is not possible that patient acceptance will lead to ugliness. This is what is impossible. Patient acceptance will lead to beauty.

source: ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་ལེ་ལོས་འཐོབ་པ་དང་། མངོན་པར་རྟོགས་པར་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་ལེ་ལོས་འཐོབ་པ་དང་། མངོན་པར་རྟོགས་པར་མི་འགྱུར་བ་དེ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། ། ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་བརྩོན་འགྲུས་ཀྱིས་འཐོབ་པ་དང་། མངོན་པར་རྟོགས་པར་མི་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་བརྩོན་འགྲུས་ཀྱིས་འཐོབ་པ་དང་། མངོན་པར་རྟོགས་པར་འགྱུར་བ་དེ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ།།
en: “Śāriputra, it is not possible that laziness will lead to attainment and realization. This is what is impossible. With laziness there will be no attainment or realization. Śāriputra, it is not possible that with vigor there will be no attainment or realization. This is what is impossible. Vigor will lead to attainment and realization.

source: ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་སེམས་གཡེངས་པས་ངེས་པར་གྱུར་པ་ལ་འཇུག་པར་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ནོ།། གང་སེམས་གཡེངས་པས་ངེས་པར་འགྱུར་བ་ལ་མི་འཇུག་པ་དེ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ།། ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་སེམས་རྩེ་གཅིག་པ་ངེས་པར་གྱུར་པ་ལ་མི་འཇུག་པར་མི་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་སེམས་རྩེ་གཅིག་པ་ངེས་པར་གྱུར་བ་ལ་འཇུག་པར་འགྱུར་བ་དེ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། །
en: “Śāriputra, it is not possible that a scattered mind will arrive at certainty. This is what is impossible. A scattered mind will fail to arrive at certainty. Śāriputra, it is not possible that a one-pointed mind will fail to arrive at certainty. This is what is impossible. A one-pointed mind will arrive at certainty.

source: ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་འཆལ་བའི་ཤེས་རབ་ཀྱིས་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ཡང་དག་པར་འཇོམ་པ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་འཆལ་བའི་ཤེས་རབ་ཀྱིས་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ཡང་དག་པར་འཇོམ་པ་ར་མི་འགྱུར་བ་དེ་ནི་གནས་ཡོད་དེ་སྐབས་ཡོད་དོ། ། ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། ། གང་ཤེས་རབ་ཀྱིས་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ཡང་དག་པར་འཇོམ་པར་མི་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་ཤེས་རབ་ཀྱིས་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ཡང་དག་པར་འཇོམ་པར་མི་འགྱུར་བ་དེ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། །
en: “Śāriputra, it is not possible that faulty knowledge will lead to the eradication of the continuum of habitual tendencies. This is what is impossible. Faulty knowledge will not lead to the eradication of the continuum of habitual tendencies. Śāriputra, it is not possible that genuine knowledge will fail to lead to the eradication of the continuum of habitual tendencies. This is what is impossible. Genuine knowledge will lead to the eradication of the continuum of habitual tendencies.

source: ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། ། གང་སྲོག་གཅོད་པའི་སྐྱེས་བུ་གང་ཟག་སྲོག་གཅོད་པའི་རྒྱུས་ཚེ་རིང་པོར་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། ཡང་ཤཱ་རིའི་བུ་སྲོག་གཅོད་པའི་སྐྱེས་བུ་གང་ཟག་ཚེ་ཐུང་བར་འགྱུར་བ་དེ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། ། ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་སྲོག་གཅོད་པ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ཚེ་ཐུང་བར་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། ཡང་ཤཱ་རིའི་བུ་གང་སྲོག་གཅོད་པ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ཚེ་རིང་པོར་འགྱུར་བ་དེ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། །
en: “Śāriputra, it is not possible that a person who takes life will have a longer lifespan because he has taken life. This is what is impossible. Śāriputra, a person who takes life will have a shorter lifespan. Śāriputra, it is not possible that a person who avoids taking life will in return have a shorter lifespan. This is what is impossible. Śāriputra, a person who avoids taking life will in return have a longer lifespan.

source: ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་མ་བྱིན་པར་ལེན་པའི་སྐྱེས་བུ་གང་ཟག་ལོངས་སྤྱོད་ཆེན་པོ་རྙེད་པ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། ཡང་ཤཱ་རིའི་བུ་མ་བྱིན་པར་ལེན་པའི་སྐྱེས་བུ་གང་ཟག་དབུལ་པོར་འགྱུར་བ་དེ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། ། ཡང་ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་མ་བྱིན་པར་ལེན་པ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་དབུལ་པོར་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་མ་བྱིན་པར་ལེན་པ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ལོངས་སྤྱོད་ཆེན་པོར་འགྱུར་བ་དེ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། །
en: “Śāriputra, it is not possible that a person who takes what has not been given will obtain great riches. This is what is impossible. Śāriputra, a person who takes what has not been given will in turn become poor. Śāriputra, it is not possible that a person who avoids taking what has not been given will become poor. This is what is impossible. Śāriputra, a person who avoids taking what has not been given will obtain great riches.

source: ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་འདོད་པ་ལ་ལོག་པར་གཡེམ་པའི་སྐྱེས་བུ་གང་ཟག་ཆུང་མ་འགྲན་ཟླ་མེད་པ་རྙེད་པ་དེ་ནི་གནས་མ་ཡིན་ནོ། ཡང་ཤཱ་རིའི་བུ་འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་སྐྱེས་བུ་གང་ཟག་ཆུང་མ་འགྲན་ཟླ་ཡོད་པ་རྙེད་པ་དེ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། ། ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ཆུང་མ་འགྲན་ཟླ་དང་བཅས་པ་རྙེད་པ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། ཡང་ཤཱ་རིའི་བུ་འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ཆུང་མ་འགྲན་ཟླ་མེད་པ་རྙེད་པ་དེ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། །
en: “Śāriputra, it is not possible that a person who engages in sexual misconduct will have a cooperative wife. This is what is impossible. Śāriputra, a person who engages in sexual misconduct will have a quarrelsome wife. Śāriputra, it is not possible that a person who avoids sexual misconduct will have a quarrelsome wife. This is what is impossible. Śāriputra, a person who avoids sexual misconduct will have a cooperative wife.
